base/Documents/бит_ВерсияОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ВерсияОтчета</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccumulationRegister.бит_ПоказателиПроизвольныхОтчетов</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Comment>Настройка отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Comment>Язык</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартныйПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭкземплярыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДвижений</Name>
					<Comment>Дата движений</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТабДокумент</Name>
					<Comment>Хранилище таб документ</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьДвиженияПоБюджету</Name>
					<Comment>Формировать движения по бюджету</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗависимыхОборотов</Name>
					<Comment>Режим формирования зависимых оборотов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗависимыхОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборХранение</Name>
					<Comment>Отбор хранение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыХранение</Name>
					<Comment>Параметры хранение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровЗапроса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеОбороты</Name>
					<Comment>Зависимые обороты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Comment>Идентификатор строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД_Родитель</Name>
							<Comment>Идентификатор строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Период</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Comment>Статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_ВерсияОтчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ФормироватьДвиженияПоБюджету Тогда
		
		ПроверяемыеРеквизиты.Добавить("Сценарий");
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	Организация = Справочники.Организации.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов) Тогда
		РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("Проведен",    Проведен);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗаполнитьЗависимыеОбороты();
	КонецЕсли; 
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли; 
	
	// Запишем автора и последнего изменившего.
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор         = Пользователи.ТекущийПользователь();
		ДатаСоздания  = ТекущаяДата();
	КонецЕсли; 
	
	Ответственный = Пользователи.ТекущийПользователь();
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("ДанныеОтчета") Тогда
		
		НаборДанные = РегистрыСведений.бит_ДанныеПроизвольныхОтчетов.СоздатьНаборЗаписей();
		НаборДанные.Отбор.ВерсияОтчета.Установить(Ссылка, Истина);
		
		Для каждого СтрокаТаблицы Из ДополнительныеСвойства.ДанныеОтчета Цикл
			Запись = НаборДанные.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,СтрокаТаблицы);
			Запись.Валюта       = ВалютаДокумента;
			Запись.ВерсияОтчета = Ссылка;
		КонецЦикла; 
		НаборДанные.Записать();
		ДополнительныеСвойства.Удалить("ДополнительныеСвойства");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Реквизиты = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим курсы валют, необходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Документ, Регл, Упр, Сценарий");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, Реквизиты.Дата, ВидыКурсов);
	
	Если ДополнительныеСвойства.Свойство("СтруктураТаблиц") Тогда
		ТаблицыДокумента = ДополнительныеСвойства.СтруктураТаблиц;	
	Иначе	
		ТаблицыДокумента = ПодготовитьТаблицыДокумента(Реквизиты,СтруктураКурсыВалют);	
	КонецЕсли; 
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Реквизиты, ТаблицыДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Реквизиты = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Если Реквизиты.ФормироватьДвиженияПоБюджету Тогда
	
		// Получим курсы валют, необходимые для выполнения пересчетов.
		ВидыКурсов = Новый Структура("Документ, Регл, Упр, Сценарий");
		СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, Реквизиты.Дата, ВидыКурсов);
		
		ТаблицыДокумента = ПодготовитьТаблицыДокумента(Реквизиты,СтруктураКурсыВалют);	

		бит_Бюджетирование.ПроверитьФиксацию(Реквизиты.Сценарий, ТаблицыДокумента.ТаблицаБюджета, Отказ);

		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
    Если НЕ Отказ Тогда
		бит_ВизированиеСервер.ОчиститьВсеВизыБезусловно(Ссылка);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет сохранение табличного документа с результатами отчета в хранилище.
// 
// Параметры:
//  ТабДок  - ТабличныйДокумент.
// 
Процедура СохранитьТабДокРезультат(ТабДок)  Экспорт
	
	ТД = Новый ТабличныйДокумент;
	
	ТД.ФиксацияСверху = ТабДок.ФиксацияСверху;
	ТД.ФиксацияСлева  = ТабДок.ФиксацияСлева;
	ТД.Вывести(ТабДок);
	
	ХранилищеТабДокумент = Новый ХранилищеЗначения(ТД, Новый СжатиеДанных(9));
	
КонецПроцедуры // СохранитьТабДокРезультат()

// Функция выполняет получение табличного документа с результатами отчета из хранилища.
// 
// Возвращаемое значение:
//   СохраненныйТабДокумент   - ТабличныйДокумент.
// 
Функция ПолучитьТабДокРезультат() Экспорт

	СохраненныйТабДокумент = ХранилищеТабДокумент.Получить();
	
	Если Не ТипЗнч(СохраненныйТабДокумент) = Тип("ТабличныйДокумент") Тогда
	
		СохраненныйТабДокумент = Новый ТабличныйДокумент;
				
	КонецЕсли;	

	Возврат СохраненныйТабДокумент;
	
КонецФункции // ПолучитьТабДокРезультат()

// Процедура устанавливает номер версии отчета.
// 
Процедура УстановитьНомерВерсии() Экспорт

	КоличествоСохраненных = 0;
	
	// Определим количество сохраненных версий отчета.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ЭкземплярОтчета",ЭкземплярОтчета);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СУММА(1) КАК КоличествоСохраненных
	                |ИЗ
	                |	Документ.бит_ВерсияОтчета КАК бит_ВерсияОтчета
	                |ГДЕ
	                |	бит_ВерсияОтчета.ЭкземплярОтчета = &ЭкземплярОтчета
	                |	И бит_ВерсияОтчета.Ссылка <> &Ссылка";
					
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.КоличествоСохраненных) Тогда
			
			КоличествоСохраненных = Выборка.КоличествоСохраненных;
			
		КонецЕсли; 
	
	КонецЕсли; 

	НомерВерсии = КоличествоСохраненных+1;
	
	// Дополним номер нулями слева
	СтрФормат   = "ЧЦ="+Метаданные().ДлинаНомера+"; ЧВН=; ЧГ=0";
	СтрНомер    = Формат(НомерВерсии,СтрФормат);
	
	Номер = СтрНомер;
	
КонецПроцедуры // УстановитьНомерВерсии()

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры // ОчиститьЗависимыеОбороты()

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	ОчиститьЗависимыеОбороты();
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов)
		ИЛИ РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
		// Не формируем зависимые обороты.
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим курсы валют, необходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Документ, Регл, Упр, Сценарий");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента,СтруктураКурсыВалют);	
	
	БДДС = СтруктураТаблиц.ТаблицаБюджета.Скопировать();
	
	БДДС.Колонки.Добавить("ИД", Новый ОписаниеТипов("Строка", ,
									Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = БДДС;
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));
	
	ТаблицаБюджета = СтруктураТаблиц.ТаблицаБюджета;
	Для каждого Стр Из ЗависимыеОбороты Цикл
	
		НоваяСтрока = ТаблицаБюджета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		НоваяСтрока.Сценарий 		= Сценарий;
		НоваяСтрока.Валюта 			= ВалютаДокумента;
		НоваяСтрока.СтавкаНДС 		= Стр.СтатьяОборотов.СтавкаНДС;
		НоваяСтрока.ЭтоКоэффициент 	= Стр.СтатьяОборотов.ЭтоКоэффициент;
		
	КонецЦикла; 
	
	КурсыПоПериодам = Неопределено;
	
	Если Сценарий.ИспользоватьКурсыСценария Тогда
		
		ТаблицаПериодов = ТаблицаБюджета.Скопировать();
		ТаблицаПериодов.Свернуть("Период");
		
		// Установим настройки для получения курсов по периодам.
		СтруктураПараметров = бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Сценарий, ВалютаДокумента);
		
		// Получим курсы по периодам.
		КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров, Сценарий);
		
	КонецЕсли;
	
	бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ТаблицаБюджета, КурсыПоПериодам, СтруктураКурсыВалют);
	
	ДополнительныеСвойства.Вставить("СтруктураТаблиц", СтруктураТаблиц);
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры // ЗаполнитьЗависимыеОбороты()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента,СтруктураКурсыВалют)  Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеОтчетов.ВерсияОтчета КАК ВерсияОтчета,
	|	ДанныеОтчетов.ПоказательОтчета КАК ПоказательОтчета,
	|	ДанныеОтчетов.ИД КАК ИД,
	|	ДанныеОтчетов.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	ДанныеОтчетов.Валюта КАК Валюта,
	|	ДанныеОтчетов.ПериодДанных КАК ПериодДанных,
	|	ДанныеОтчетов.Аналитика_1 КАК Аналитика_1,
	|	ДанныеОтчетов.Аналитика_2 КАК Аналитика_2,
	|	ДанныеОтчетов.Аналитика_3 КАК Аналитика_3,
	|	ДанныеОтчетов.Аналитика_4 КАК Аналитика_4,
	|	ДанныеОтчетов.Аналитика_5 КАК Аналитика_5,
	|	ДанныеОтчетов.Аналитика_6 КАК Аналитика_6,
	|	ДанныеОтчетов.Аналитика_7 КАК Аналитика_7,
	|	&ДополнительныеАналитики КАК ДополнительныеАналитики,
	|	ПоказателиПроизвольныхОтчетов.КоличественныйУчет КАК ИндексРесурса,
	|	ДанныеОтчетов.ФормироватьДвиженияПоБюджету КАК ФормироватьДвиженияПоБюджету
	|ПОМЕСТИТЬ ДанныеОтчетов
	|ИЗ
	|	РегистрСведений.бит_ДанныеПроизвольныхОтчетов КАК ДанныеОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ПоказателиПроизвольныхОтчетов КАК ПоказателиПроизвольныхОтчетов
	|		ПО ДанныеОтчетов.ПоказательОтчета = ПоказателиПроизвольныхОтчетов.Ссылка
	|ГДЕ
	|	ДанныеОтчетов.ВерсияОтчета = &ВерсияОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОтчетов.ВерсияОтчета КАК ВерсияОтчета,
	|	ДанныеОтчетов.ПоказательОтчета КАК ПоказательОтчета,
	|	ДанныеОтчетов.ПериодДанных КАК ПериодДанных,
	|	СУММА(ДанныеОтчетов.ЗначениеПоказателя) КАК ЗначениеПоказателя
	|ИЗ
	|	ДанныеОтчетов КАК ДанныеОтчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОтчетов.ПоказательОтчета,
	|	ДанныеОтчетов.ПериодДанных,
	|	ДанныеОтчетов.ВерсияОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОтчетов.ВерсияОтчета КАК ВерсияОтчета,
	|	ДанныеОтчетов.ПоказательОтчета КАК ПоказательОтчета,
	|	ДанныеОтчетов.ИД КАК ИД,
	|	ДанныеОтчетов.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	ДанныеОтчетов.Валюта КАК Валюта,
	|	ДанныеОтчетов.ПериодДанных КАК ПериодДанных,
	|	ДанныеОтчетов.Аналитика_1 КАК Аналитика_1,
	|	ДанныеОтчетов.Аналитика_2 КАК Аналитика_2,
	|	ДанныеОтчетов.Аналитика_3 КАК Аналитика_3,
	|	ДанныеОтчетов.Аналитика_4 КАК Аналитика_4,
	|	ДанныеОтчетов.Аналитика_5 КАК Аналитика_5,
	|	ДанныеОтчетов.Аналитика_6 КАК Аналитика_6,
	|	ДанныеОтчетов.Аналитика_7 КАК Аналитика_7,
	|	&ДополнительныеАналитики КАК ДополнительныеАналитики,
	|	ДанныеОтчетов.ИндексРесурса КАК ИндексРесурса
	|ИЗ
	|	ДанныеОтчетов КАК ДанныеОтчетов
	|ГДЕ
	|	ДанныеОтчетов.ФормироватьДвиженияПоБюджету";
	
	ЧтоЗаменить   = "&ДополнительныеАналитики КАК ДополнительныеАналитики,";
	НаЧтоЗаменить = "";
	Шаблон        = "ДанныеОтчетов.Аналитика_%1 КАК Аналитика_%1,";
	
	Вграница = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	Для Индекс = 8 По Вграница Цикл
		Разделитель   = ?(ПустаяСтрока(НаЧтоЗаменить),"",Символы.ПС);
		НаЧтоЗаменить = НаЧтоЗаменить + Разделитель + СтрШаблон(Шаблон, Индекс);
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВерсияОтчета",Ссылка);

	Пакет = Запрос.ВыполнитьПакет();
	ПараметрыПроведения = Новый Структура; 
 	ПараметрыПроведения.Вставить("ТабДанные", 	   Пакет[1].Выгрузить());
	ПараметрыПроведения.Вставить("ТаблицаБюджета", Пакет[2].Выбрать());
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТабДанные", ПараметрыПроведения.ТабДанные);
	
	РеквизитыСтатей = Новый Соответствие(); // Кэширование реквизитов статей для лвижений.
	
	Если СтруктураШапкиДокумента.ФормироватьДвиженияПоБюджету Тогда
		
		ТаблицаБюджета    = КонструкторТаблицаБюджета();
		ПравилаЗаполнения = ПравилаЗаполненияБюджета();
		
		Исключения = Новый Массив;
		Исключения.Добавить("Сценарий");
		Исключения.Добавить("ЦФО");	
		Исключения.Добавить("СтатьяОборотов");				
		
		ИзмеренияБюджета = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все", "Имя", "Структура", Исключения);
		Выборка   		 = ПараметрыПроведения.ТаблицаБюджета;
		
		Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ДатаДвижений) Тогда
			ДатаДвижений =	СтруктураШапкиДокумента.ДатаДвижений;
		Иначе
			ДатаДвижений = СтруктураШапкиДокумента.Дата;
		КонецЕсли; 
		
		НомерСтроки = 1;
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ПериодДанных) Тогда
				Период = Выборка.ПериодДанных; 
			Иначе	
				Период = ДатаДвижений;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаБюджета.Добавить();
			НоваяСтрока.Сценарий    = СтруктураШапкиДокумента.Сценарий;
			НоваяСтрока.Период      = Период;
			НоваяСтрока.Валюта      = Выборка.Валюта;
			НоваяСтрока.СтавкаНДС   = Перечисления.СтавкиНДС.БезНДС;
			НоваяСтрока.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;

			Для каждого КиЗ Из ПравилаЗаполнения Цикл
				НоваяСтрока[КиЗ.Значение] = Выборка[КиЗ.Ключ];
			КонецЦикла; 
			
			Если ЗначениеЗаполнено(НоваяСтрока.СтатьяОборотов) Тогда
				// Статья оборотов уже должна быть заполнена.
				РеквизитыСтатьи = РеквизитыСтатьи(НоваяСтрока.СтатьяОборотов, РеквизитыСтатей);
				Для каждого КлючИЗначение Из ИзмеренияБюджета Цикл
					
					Измерение     	   = КлючИЗначение.Ключ;
					НастройкиАналитики = РеквизитыСтатьи.Измерения[Измерение];
					
					Если НЕ НастройкиАналитики.Учет Тогда
						НоваяСтрока[Измерение] = Неопределено;
					КонецЕсли; 
				КонецЦикла;		
				
				УстановитьРесурсыПроводки(РеквизитыСтатьи, Выборка, НоваяСтрока);
				НоваяСтрока.ЭтоКоэффициент = РеквизитыСтатьи.ЭтоКоэффициент;
			КонецЕсли; 
		КонецЦикла;  // По таблице показателей.
	  
		КурсыПоПериодам = Неопределено;
		Если Сценарий.ИспользоватьКурсыСценария Тогда
		  
			// Получим таблицу периодов.
			ТаблицаПериодов = ТаблицаБюджета.Скопировать();
			ТаблицаПериодов.Свернуть("Период");

			// Установим настройки для получения курсов по периодам.
			СтруктураПараметров = бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(СтруктураШапкиДокумента.Сценарий,
										СтруктураШапкиДокумента.ВалютаДокумента);

			// Получим курсы по периодам.
			КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров,
									СтруктураШапкиДокумента.Сценарий);
		КонецЕсли; 

		бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ТаблицаБюджета, КурсыПоПериодам, СтруктураКурсыВалют);

		СтруктураТаблиц.Вставить("ТаблицаБюджета",ТаблицаБюджета);

	КонецЕсли; 
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

Функция РеквизитыСтатьи(СтатьяОборотов, РеквизитыСтатей)

	РеквизитыСтатьи = РеквизитыСтатей.Получить(СтатьяОборотов);
	Если РеквизитыСтатьи = Неопределено Тогда
		РеквизитыСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(СтатьяОборотов);
		РеквизитыСтатей.Вставить(СтатьяОборотов, РеквизитыСтатьи);
	КонецЕсли; 
	
	Возврат РеквизитыСтатьи;

КонецФункции
 
Процедура УстановитьРесурсыПроводки(РеквизитыСтатьи, ДанныеУчета, Проводка)
	
	Если РеквизитыСтатьи.Учет_Количество И ДанныеУчета.ИндексРесурса = 1 Тогда
		Проводка.Количество = ДанныеУчета.ЗначениеПоказателя;
	ИначеЕсли РеквизитыСтатьи.Учет_Сумма И ДанныеУчета.ИндексРесурса = 0 Тогда	
		Проводка.Сумма = ДанныеУчета.ЗначениеПоказателя;
	КонецЕсли;	
	
КонецПроцедуры

// Функция инициализирует таблицу бюджета.
// 
// Возвращаемое значение:
//   ТаблицаБюджета   - ТаблицаЗначений.
// 
Функция КонструкторТаблицаБюджета()
				   
	ИмяТипаСценарий = бит_ОбщегоНазначения.ПолучитьИмяТипаСценарииБюджетирования();
	ИмяТипаПроект   = бит_ОбщегоНазначения.ПолучитьИмяТипаПроекты();
	ИмяТипаЦФО      = бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО();
	
	ОписаниеЧисло     = Новый ОписаниеТипов("Число");
	ОписаниеАналитики = Метаданные.ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Тип;
	
	ТаблицаБюджета = Новый ТаблицаЗначений;
	
	ТаблицаБюджета.Колонки.Добавить("НомерСтроки"        ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("Период"             ,Новый ОписаниеТипов("Дата"));
	ТаблицаБюджета.Колонки.Добавить("Сценарий"           ,Новый ОписаниеТипов(ИмяТипаСценарий));
	ТаблицаБюджета.Колонки.Добавить("ЦФО"                ,Новый ОписаниеТипов(ИмяТипаЦФО));
	ТаблицаБюджета.Колонки.Добавить("СтатьяОборотов"     ,Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	ТаблицаБюджета.Колонки.Добавить("ЭтоКоэффициент"     ,Новый ОписаниеТипов("Булево"));	
	ТаблицаБюджета.Колонки.Добавить("Аналитика_1"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_2"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_3"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_4"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_5"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_6"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_7"        ,ОписаниеАналитики);	
	ТаблицаБюджета.Колонки.Добавить("Количество"         ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("Валюта"             ,Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаБюджета.Колонки.Добавить("Сумма"              ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("СтавкаНДС"          ,бит_СтавкиНДС.ОписаниеТипаСтавкиНДС());
	ТаблицаБюджета.Колонки.Добавить("НДС"                ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("СуммаРегл"          ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("СуммаУпр"           ,ОписаниеЧисло);
	ТаблицаБюджета.Колонки.Добавить("СуммаСценарий"      ,ОписаниеЧисло);
	// ++ ЕРП 	
	ТаблицаБюджета.Колонки.Добавить("Аналитика_8"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_9"        ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_10"       ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_11"       ,ОписаниеАналитики);
	ТаблицаБюджета.Колонки.Добавить("Аналитика_12"       ,ОписаниеАналитики);
	// -- ЕРП 
	
	Возврат ТаблицаБюджета;
	
КонецФункции // КонструкторТаблицаБюджета()

// Функция определяет правила заполнения измерений регистра бит_ОборотыПоБюджету.
// Аналитикой ПроизвольногоОтчета.
// 
// 
// Возвращаемое значение:
//   ПравилаЗаполнения   - Структура.
// 
Функция ПравилаЗаполненияБюджета()

	ПравилаЗаполнения = Новый Структура;
	
	НастройкиАналитик     = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьНастройкуАналитик(НастройкаОтчета);
	НастройкиДопИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Исключения = Новый Массив;
	Исключения.Добавить("Сценарий");
	Для й = 1 По 7 Цикл // 4-?
		Исключения.Добавить("Аналитика_"+й);
	КонецЦикла; 
	
	ИзмеренияБюджета = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все","Тип","Структура",Исключения);
	
	Для каждого КиЗ Из НастройкиАналитик Цикл
	
		Настройка = КиЗ.Значение;
		
		// Обычные измерения.		
		Для каждого КиЗ_Измерения Из ИзмеренияБюджета Цикл
			
			ИмяАналитики = СокрЛП(Настройка.Аналитика.Код);
			Если ИмяАналитики = КиЗ_Измерения.Ключ Тогда
				 // Подбираем по имени.
			     ПравилаЗаполнения.Вставить(КиЗ.Ключ,КиЗ_Измерения.Ключ);
				 Продолжить;
			Иначе
				
				// Подбираем по типу.
				Сравнение = Новый СравнениеЗначений;
				РезСравнения = Сравнение.Сравнить(Настройка.ТипЗначения,КиЗ_Измерения.Значение);
				Если РезСравнения = 0 Тогда
					ПравилаЗаполнения.Вставить(КиЗ.Ключ,КиЗ_Измерения.Ключ);
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; // Обычные измерения.
		
		// Произвольные измерения
		Для каждого КиЗ_Измерения Из НастройкиДопИзмерений Цикл
			
			 НастройкаИзмерения= КиЗ_Измерения.Значение;
			 Если Настройка.Аналитика = НастройкаИзмерения.Аналитика Тогда
					ПравилаЗаполнения.Вставить(КиЗ.Ключ,КиЗ_Измерения.Ключ);
					Продолжить;
			 КонецЕсли; 
		КонецЦикла; // Произвольные измерения.
	КонецЦикла; // По настройкам аналитик.

	Возврат ПравилаЗаполнения;
	
КонецФункции // ПравилаЗаполненияБюджета()

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок)
	
	// По регистру бит_ПоказателиПроизвольныхОтчетов.
	ТаблицаДвижений = Движения.бит_ПоказателиПроизвольныхОтчетов.Выгрузить();
	
	ДатаДвижений = ?(ЗначениеЗаполнено(СтруктураШапкиДокумента.ДатаДвижений),СтруктураШапкиДокумента.ДатаДвижений,СтруктураШапкиДокумента.Дата);
	
	Для каждого СтрокаТаблицы Из СтруктураТаблиц.ТабДанные Цикл
		
		Запись = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,СтрокаТаблицы);
		Запись.Валюта = СтруктураШапкиДокумента.ВалютаДокумента;
		
		ТекПериод = ?(ЗначениеЗаполнено(СтрокаТаблицы.ПериодДанных),СтрокаТаблицы.ПериодДанных,ДатаДвижений);
		Запись.Период = ТекПериод;
		
	КонецЦикла; 
	
	Движения.бит_ПоказателиПроизвольныхОтчетов.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_ПоказателиПроизвольныхОтчетов.ДобавитьДвижение();
	
	Если СтруктураШапкиДокумента.ФормироватьДвиженияПоБюджету Тогда
		
		// Движения по регистру обороты по бюджетам.
		ТаблицаДвижений = Движения.бит_ОборотыПоБюджетам.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		Для Каждого СтрокаТаблицы Из СтруктураТаблиц.ТаблицаБюджета Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
			
		КонецЦикла; 
		
		Движения.бит_ОборотыПоБюджетам.мТаблицаДвижений = ТаблицаДвижений;
		Движения.бит_ОборотыПоБюджетам.ДобавитьДвижение();
		
		// Регистру бухгалтерии бюджетирование.
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(СтруктураТаблиц.ТаблицаБюджета,Движения.бит_Бюджетирование);
		
	КонецЕсли; 
	
КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
